src/test/resources/collections/paymentoforder.json

{
    "total_count": 2,
    "object": "list",
    "data": [
        {
            "id": "pay_aIrgi1wnYjT82422",
            "object": "payment",
            "amount": 300,
            "currency": "INR",
            "status": "captured",
            "order_id": "order_dkKfFNBczPHXuagG",
            "international": false,
            "method": "card",
            "description": "Flower Shop",
            "card": "visa-credit",
            "bank": "",
            "wallet": "",
            "vpa": "",
            "emi": null,
            "email": "madhumita.ganguly@payabbhi.com",
            "contact": "9874785847",
            "notes": {
                "Name": "Madhumita"
            },
            "fee": 6,
            "service_tax": 0,
            "payout_amount": 0,
            "payout_type": "",
            "refunded_amount": 0,
            "refund_status": "",
            "refunds": {
                "total_count": 0,
                "object": "list",
                "data": []
            },
            "error_code": "",
            "error_description": "",
            "created_at": 1531299143
        },
        {
            "id": "pay_ZzBHyEJavefF7LWR",
            "object": "payment",
            "amount": 300,
            "currency": "INR",
            "status": "failed",
            "order_id": "order_dkKfFNBczPHXuagG",
            "international": false,
            "method": "card",
            "description": "Flower Shop",
            "card": "visa-credit",
            "bank": "",
            "wallet": "",
            "vpa": "",
            "emi": null,
            "email": "madhumita.ganguly@payabbhi.com",
            "contact": "9874785847",
            "notes": {
                "Name": "Madhumita"
            },
            "fee": 0,
            "service_tax": 0,
            "payout_amount": 0,
            "payout_type": "",
            "refunded_amount": 0,
            "refund_status": "",
            "refunds": {
                "total_count": 0,
                "object": "list",
                "data": []
            },
            "error_code": "invalid_request_error",
            "error_description": "Payment Declined",
            "created_at": 1531299137
        }
    ]
}