src/test/resources/collections/refundofpayment.json

{
    "total_count": 2,
    "object": "list",
    "data": [
        {
            "id": "rfnd_IQr0lrApM9S0QaKQ",
            "object": "refund",
            "amount": 100,
            "currency": "INR",
            "payment_id": "pay_aIrgi1wnYjT82422",
            "notes": null,
            "created_at": 1531396291
        },
        {
            "id": "rfnd_1IfR1R9Q9exB6zgP",
            "object": "refund",
            "amount": 100,
            "currency": "INR",
            "payment_id": "pay_aIrgi1wnYjT82422",
            "notes": null,
            "created_at": 1531396278
        }
    ]
}