src/test/resources/collections/refunds.json

{
    "total_count": 61,
    "object": "list",
    "data": [
        {
            "id": "rfnd_XIoa6fhCMPOFi8Ct",
            "object": "refund",
            "amount": 10,
            "currency": "INR",
            "payment_id": "pay_C5OcIOxiCrZXAcHG",
            "notes": null,
            "created_at": 1531333364
        },
        {
            "id": "rfnd_nMegjyzBnXfUZTb3",
            "object": "refund",
            "amount": 2000,
            "currency": "INR",
            "payment_id": "pay_1x541IRDjvVULyqP",
            "notes": {
                "reason": "fdwfl;dklkbwekljk"
            },
            "created_at": 1529580565
        },
        {
            "id": "rfnd_NfEwRCmZCt5RDiy6",
            "object": "refund",
            "amount": 100,
            "currency": "INR",
            "payment_id": "pay_Tnz800X13B4JlK2j",
            "notes": {
                "notes": "Full Refund dot net lib"
            },
            "created_at": 1526294926
        },
        {
            "id": "rfnd_XorO1GGIY74bUI9E",
            "object": "refund",
            "amount": 100,
            "currency": "INR",
            "payment_id": "pay_iIOKafM01ThYaQTE",
            "notes": {
                "notes": "Partial Refund dot net lib"
            },
            "created_at": 1526294924
        },
        {
            "id": "rfnd_jSUNNX9ryPZ6cuJ0",
            "object": "refund",
            "amount": 100,
            "currency": "INR",
            "payment_id": "pay_Gg7xZWZmpLCtorqO",
            "notes": {
                "item": "Full Refund a Payment"
            },
            "created_at": 1526294921
        },
        {
            "id": "rfnd_eOlqDaAdFa1XeFLQ",
            "object": "refund",
            "amount": 100,
            "currency": "INR",
            "payment_id": "pay_WMLI1vdIKSSipilt",
            "notes": {
                "sales_channel": "website"
            },
            "created_at": 1525447517
        },
        {
            "id": "rfnd_8QCLSCWFNGNEVMwu",
            "object": "refund",
            "amount": 100,
            "currency": "INR",
            "payment_id": "pay_R6mPqlzzukJTgWbS",
            "notes": {
                "sales_channel": "website"
            },
            "created_at": 1525447310
        },
        {
            "id": "rfnd_aewp8JuClPURNTMX",
            "object": "refund",
            "amount": 462,
            "currency": "INR",
            "payment_id": "pay_PEGclfkKWWHbi2H8",
            "notes": null,
            "created_at": 1525447310
        },
        {
            "id": "rfnd_QYoJRX0PA6of2y0f",
            "object": "refund",
            "amount": 265,
            "currency": "INR",
            "payment_id": "pay_C9TQyyQZrl5ObZjd",
            "notes": null,
            "created_at": 1525446840
        },
        {
            "id": "rfnd_WUBZXrl3ybLAVao7",
            "object": "refund",
            "amount": 420,
            "currency": "INR",
            "payment_id": "pay_9lnr4INeCk30AGvF",
            "notes": null,
            "created_at": 1525446261
        }
    ]
}